1351731172989050882 2021-01-20 11:20:00 +0800 <JoeBiden> Tonight, in Washington, D.C. and across the nation, we came together to honor the over 400,000 Americans we’ve lost to COVID-19. The last year has tested us in unimaginable ways, but now it’s time we begin to heal and overcome — together.  https://t.co/DuWhN1xjNO
1351653131248041984 2021-01-20 06:09:53 +0800 <JoeBiden> Join us for a national moment of unity and remembrance in honor of the 400,000 Americans we’ve lost due to COVID-19.  https://t.co/0BW7AQLxUx
1349563892087869442 2021-01-14 11:48:00 +0800 <JoeBiden> We’re in the teeth of this crisis, and we need to take immediate action to get the virus under control. That’s why tomorrow, I’ll be laying out my vaccination and economic rescue package to beat COVID-19 and build back better.
1348763039160532992 2021-01-12 06:45:41 +0800 <JoeBiden> Folks, I just received the second dose of my COVID-19 vaccine — and just like the first dose, it was safe, quick, and painless.   I urge everyone to get vaccinated once it’s your turn. Because only together can we save lives and beat this virus.  https://t.co/w1m8gEh2iL
1344021093321826305 2020-12-30 04:42:54 +0800 <JoeBiden> Tune in as I deliver remarks on the ongoing COVID-19 crisis and what my administration will do to get this virus under control.  https://t.co/cW9z2nkEkP
1343734732282974208 2020-12-29 09:45:00 +0800 <JoeBiden> This year, we’ve painfully learned the cost of being unprepared for a pandemic.   If we aren’t investing with our partners around the world, we’re undermining our ability to defeat COVID-19 and leaving ourselves vulnerable to the next deadly epidemic.
1343320754478190593 2020-12-28 06:20:00 +0800 <JoeBiden> From COVID-19 and the economy to climate change and racial justice — our nation is facing four historic crises at once. And come January, there will be no time to waste. That’s why my team and I are hard at work preparing to take action on day one.
1341255898711220225 2020-12-22 13:35:00 +0800 <JoeBiden> I applaud this relief package, but our work is far from over. Starting in the new year, Congress will need to immediately get to work on support for our COVID-19 plan.  My message to everyone out there struggling right now: help is on the way.
1341185434408415233 2020-12-22 08:55:00 +0800 <JoeBiden> Today, I received the COVID-19 vaccine.  To the scientists and researchers who worked tirelessly to make this possible — thank you. We owe you an awful lot.  And to the American people — know there is nothing to worry about. When the vaccine is available, I urge you to take it.  https://t.co/QBtB620i2V
1338215867394437129 2020-12-14 04:15:00 +0800 <JoeBiden> We’re in the teeth of the COVID-19 crisis right now, and this nation needs presidential leadership.  Leadership that is willing to model the steps we all should be taking in our own lives.
1337872354844807176 2020-12-13 05:30:00 +0800 <JoeBiden> My first 100 days won’t end COVID-19, but we can slow the spread, save lives, and get back to our lives with our loved ones.  https://t.co/nz2YkjhQZa
1337526826747367426 2020-12-12 06:37:00 +0800 <JoeBiden> Beating COVID-19 will take everyone doing their part.  Wear a mask. Social distance. Limit travel over the holidays.   We can end this, together.
1337246228028022785 2020-12-11 12:02:00 +0800 <JoeBiden> Yesterday marked another tragic, preventable milestone in our fight against COVID-19, but this news is a bright light. I’m grateful for every scientist, researcher, and public health expert who made it possible.
1336456776162529280 2020-12-09 07:45:00 +0800 <JoeBiden> Today, I'm announcing key COVID-19 priorities for the first 100 days of my administration:  - Everyone wears a mask - 100 million vaccinations - Reopen the majority of schools  With these steps, we can change the course of the disease and change life in America for the better.
1335619257376247811 2020-12-07 00:17:00 +0800 <JoeBiden> With COVID-19 cases rising across the nation, we need to ramp up our production of personal protective equipment. We have to ensure our brave health care workers have everything they need to safely battle this virus.
1335234975411499008 2020-12-05 22:50:00 +0800 <JoeBiden> Our country is in the middle of a dramatic spike in COVID-19 cases. Please wear a mask, keep social distancing, and limit the size of any groups. It’s our patriotic duty as Americans.
1334530332167729154 2020-12-04 00:10:00 +0800 <JoeBiden> Yesterday, I spent the afternoon hearing from workers and small business owners on the economic impact COVID-19 has had on their lives. Americans are hurting — it’s why as president, I’ll work to provide immediate relief and get our economy back on track.  https://t.co/Cyw0DhJCpP
1333466572913041408 2020-12-01 01:43:00 +0800 <JoeBiden> We have no time to lose to address the economic crisis we face and build our economy back better.  This team will be ready on Day One to pull every lever of government to help those hardest hit by COVID-19 and right the structural inequalities in our economy.  https://t.co/cQ2MqV0mIW
1332407091953364996 2020-11-28 03:33:00 +0800 <JoeBiden> This is the moment where we need to steel our spines, redouble our efforts, and recommit ourselves to the fight against COVID-19.  Let’s remember: We are all in this together.  https://t.co/eliNEe7XCL
1331661304512253954 2020-11-26 02:09:30 +0800 <JoeBiden> The COVID-19 pandemic has made matters worse, creating a “shadow pandemic” for many women and girls who are largely confined to their home with their abuser and facing economic insecurity that makes escape more difficult.
1331066759735091203 2020-11-24 10:47:00 +0800 <JoeBiden> Vice President-elect @KamalaHarris and I spent the afternoon meeting with a bipartisan group of mayors. It was just the start of what I know will be a strong partnership in the months and years ahead. Together, we’re going to beat COVID-19 and build back better.  https://t.co/2oiKD7gxAi
1330194266375720965 2020-11-22 01:00:01 +0800 <JoeBiden> Anyone who wants a COVID-19 test should be able to get one. Period.
1329616705061068807 2020-11-20 10:45:00 +0800 <JoeBiden> To the families and friends of those we've lost due to COVID-19 — Jill and I send our love and prayers.  We know how tough it is to find purpose in the memory of the loved one you lost. It will take time — but you will find it, and we will find our purpose as a nation.  https://t.co/paD7CcG8ns
1329567883467259904 2020-11-20 07:31:00 +0800 <JoeBiden> This afternoon, @KamalaHarris and I met with a bipartisan group of governors from the @NatlGovsAssoc’s Executive Committee. We might be Democrats and Republicans, but we’re Americans first — and together, we’re going to beat COVID-19.  https://t.co/pEkHtf4l4d
1329531656894484480 2020-11-20 05:07:03 +0800 <JoeBiden> Throughout the pandemic, our nation’s governors have stepped up to meet the moment. @KamalaHarris and I just met with the @NatlGovsAssoc to discuss how we’ll work together to combat COVID-19. Tune in.  https://t.co/YiTjkIStbU
1327418361001676800 2020-11-14 09:09:34 +0800 <JoeBiden> I am the president-elect, but will not be president until next year. COVID-19 does not respect dates on the calendar, it is accelerating right now. Urgent action is needed today, now, by the current administration.
1327418359848300545 2020-11-14 09:09:33 +0800 <JoeBiden> I am alarmed by the surge in reported COVID-19 infections, hospitalizations, and fatalities. This crisis demands a robust and immediate federal response which has been woefully lacking.
1326214285949865986 2020-11-11 01:25:00 +0800 <JoeBiden> .@KamalaHarris and I aren’t wasting any time. We’re ready to get COVID-19 under control so that we can reopen our businesses and schools safely, resume our lives, and put this pandemic behind us.  https://t.co/65C1XfR9rR
1325873288711712769 2020-11-10 02:50:00 +0800 <JoeBiden> My COVID-19 Transition Advisory Board will advise on detailed plans built on a bedrock of science, and that keep compassion, empathy, and care for every American at its core.
1325870017401905152 2020-11-10 02:37:00 +0800 <JoeBiden> Today, I have named a COVID-19 Transition Advisory Board, comprised of distinguished public health experts, to help our transition team translate the Biden-Harris COVID-19 plan into a blueprint we can put into place as soon as @KamalaHarris and I are sworn into office.
1325842292444291072 2020-11-10 00:46:50 +0800 <JoeBiden> I spent the morning with the co-chairs of my COVID-19 Council discussing the status of this pandemic and how we move forward. Tune in as I provide an update on how we're going to beat this virus.  https://t.co/VVGHZNnUFY
1324469173297303552 2020-11-06 05:50:33 +0800 <JoeBiden> I spent the afternoon attending briefings on the ongoing COVID-19 crisis and the state of the economy. Tune in as I provide an update on these briefings and efforts to count every vote.  https://t.co/duoDWfzf5C
1323512734781067265 2020-11-03 14:30:00 +0800 <JoeBiden> Under President Trump:  - Over 230,000 Americans have died from COVID-19 - 30 million people have lost hours, paychecks, or jobs - Nearly one in five small businesses have closed  Are you better off than you were four years ago?
1323357964737089540 2020-11-03 04:15:00 +0800 <JoeBiden> In public, President Trump compared COVID-19 to the flu and suggested people inject bleach to treat it.  In private, he told Bob Woodward it was deadlier than the flu and that he wanted to downplay it.  It’s unthinkable.
1323291275613757442 2020-11-02 23:50:00 +0800 <JoeBiden> This is my commitment to you: We will make sure every American has access to a free and safe COVID-19 vaccine.
1323077868990193672 2020-11-02 09:42:00 +0800 <JoeBiden> Donald Trump’s COVID-19 response has been the greatest failure of presidential leadership in our nation’s history.
1322971669355483139 2020-11-02 02:40:00 +0800 <JoeBiden> More than 230,000 Americans have died from COVID-19 –– and Donald Trump has given up on trying to get the virus under control.  He may have quit on you, but I promise I never will.
1322531268152729601 2020-10-31 21:30:00 +0800 <JoeBiden> Every single American deserves access to regular, reliable, and free COVID-19 testing. Period.
1322519943167021056 2020-10-31 20:45:00 +0800 <JoeBiden> President Trump still has no plan to address COVID-19.  He quit on you, on your family, on America. He just wants us to grow numb to the horrors of the death toll and the pain.  We cannot afford another four years of his failed leadership.
1322320377943527424 2020-10-31 07:32:00 +0800 <JoeBiden> More than 9 million cases of COVID-19 have been now confirmed in the United States — and more than 228,000 Americans have lost their lives.  It is as severe an indictment of a president’s record as one can possibly imagine, and it is utterly disqualifying.
1321942639109918720 2020-10-30 06:31:00 +0800 <JoeBiden> You have my word: if I have the honor of serving as your president, I will do everything in my power to defeat COVID-19.  Here’s my plan to get it done:  https://t.co/zUWDfi0yQ8
1321563893001408512 2020-10-29 05:26:00 +0800 <JoeBiden> You can't make this up: Yesterday, the White House science office put out a statement listing "ending the COVID-19 pandemic" as the top accomplishment of President Trump's first term.   https://t.co/46VkWJE0GN
1320401735534268416 2020-10-26 00:28:00 +0800 <JoeBiden> The hard truth is it didn't have to be this bad. But Donald Trump's shortsighted actions weakened our ability to respond to a pandemic long before COVID-19 reached our shores.
1320041360771051522 2020-10-25 00:36:00 +0800 <JoeBiden> On Thursday, President Trump said we're "rounding the turn" when it comes to COVID-19.  On Friday, we set a new record for daily cases.   We're paying the price for his failures every single day.
1319740377486688257 2020-10-24 04:40:00 +0800 <JoeBiden> A slight change of tone from the president for one night doesn’t cover up the lies he told. It doesn’t change the fact that over 220,000 Americans have died from COVID-19 on his watch.  We can’t take another four years of Donald Trump’s failed leadership.
1319723264927649792 2020-10-24 03:32:00 +0800 <JoeBiden> After eight months of this pandemic, we finally found President Trump's plan to beat COVID-19.  https://t.co/KO4g328Uvr
1317895724105895939 2020-10-19 02:30:00 +0800 <JoeBiden> COVID-19 cases are on the rise across the nation.  But instead of leading by example, Donald Trump continues to put others in danger with his campaign events that ignore expert-recommended precautions.  Every day he proves just how unfit he is to lead America through this crisis.
1316894877649653761 2020-10-16 08:13:00 +0800 <JoeBiden> Over 215,000 Americans have died from COVID-19, and what is President Trump doing?  Nothing.
1316506571082522626 2020-10-15 06:30:00 +0800 <JoeBiden> If President Trump has his way in the U.S. Supreme Court, long-term complications from COVID-19, like lung scarring and heart damage, will become pre-existing conditions that could result in higher premiums or denied coverage.  It’s unconscionable.
1316110207366250496 2020-10-14 04:15:00 +0800 <JoeBiden> 215,000 Americans have died from COVID-19 on Donald Trump’s watch.   It’s the greatest failure of presidential leadership in our nation’s history.
1315374108218064896 2020-10-12 03:30:00 +0800 <JoeBiden> When President Trump was told one thousand Americans were dying every day from COVID-19, he shrugged it off and said, "it is what it is."  It is what it is?  This president doesn't even pretend to care about the Americans he swore to serve. It's disgraceful.
1314639768227966977 2020-10-10 02:52:00 +0800 <JoeBiden> Why did Donald Trump tell Bob Woodward the truth about COVID-19, but not the American people?
1314011006650273792 2020-10-08 09:13:31 +0800 <JoeBiden> We’re eight months into this pandemic and Donald Trump and Mike Pence still have no plan to deal with COVID-19. He’s still hoping it will just “disappear.”  @KamalaHarris and I have a comprehensive, science-backed plan to defeat this virus.  Take a look:  https://t.co/xjxsDn2qCD
1311828242517680135 2020-10-02 08:40:00 +0800 <JoeBiden> Donald Trump will do everything he can to distract from the fact that because of his failed COVID-19 response:  - Over 200,000 Americans have died - 26 million are on unemployment - 1 in 6 small businesses risk permanent closure  We can’t let him.
1310627077809344513 2020-09-29 01:07:00 +0800 <JoeBiden> Here's the deal: Until we deal with COVID-19, we'll never get our economy fully back on track, get our kids safely back to school, or get our lives back.  It's why as president, I won't waste a day getting this virus under control.  https://t.co/xjxsDmKPe3
1309949613533659136 2020-09-27 04:15:00 +0800 <JoeBiden> When Ebola hit, President Obama and I took swift action and successfully contained the virus.  After COVID-19 hit, President Trump lied to the American people and said it would miraculously "disappear."  Now, over 200,000 lives have been cut short.  It's a national tragedy.
1309869586318110721 2020-09-26 22:57:00 +0800 <JoeBiden> If I'm elected, I won't wait to take action on COVID-19.  Minutes after the race is called, I’ll call Dr. Fauci and ask him to stay on.  During my transition, I’ll bring together experts and leaders from both parties to chart a path forward.  We will overcome this, together.
1308959338384384002 2020-09-24 10:40:00 +0800 <JoeBiden> The 200,000 people we've lost to COVID-19 weren't nobodies, Mr. President.  They were our parents and grandparents, sons and daughters, friends and co-workers.  They were Americans.  https://t.co/EcdaEiwgUS
1308451240838344706 2020-09-23 01:01:00 +0800 <JoeBiden> 200,000 Americans have died from this virus.  It’s a staggering number that’s hard to wrap your head around. But behind every COVID-19 death is a family and community that will never again be the same.  There’s a devastating human toll to this pandemic — and we can’t forget that.
1307002947285315586 2020-09-19 01:06:00 +0800 <JoeBiden> When we needed Donald Trump to tell the truth about COVID-19, he lied to us.  When we needed him to take action to contain its spread, he spent his days golfing.  When we needed a president the most, he was nowhere to be found.  It's unforgivable.
1306749527366410240 2020-09-18 08:19:00 +0800 <JoeBiden> President Trump knew how deadly COVID-19 was and did nothing. It’s close to criminal. #BidenTownHall  https://t.co/OL3uIA1QSZ
1306661700054196227 2020-09-18 02:30:00 +0800 <JoeBiden> The 100 richest Americans have made more than $300 billion during the COVID-19 crisis.   Now, in the middle of a pandemic and economic crisis, Donald Trump wants to give them a $29 billion tax break.   Let that sink in.
1306612373722030081 2020-09-17 23:14:00 +0800 <JoeBiden> We've had to endure President Trump's incompetence and dishonesty when it comes to testing, wearing masks, and socially distancing.    We can't afford a repeat of those fiascos with a COVID-19 vaccine.  The stakes are too high.
1306594254765068288 2020-09-17 22:02:00 +0800 <JoeBiden> Yesterday, I met with some of our nation's top experts to discuss how we distribute a safe and effective COVID-19 vaccine. If I win this election, I know that there won't be a minute to waste. I'll get to work on day one implementing an effective distribution plan.  https://t.co/GfgSnBwjTQ
1306319984721682432 2020-09-17 03:52:09 +0800 <JoeBiden> We all want a COVID-19 vaccine as soon as possible, but it needs to be based on science — not politics. Tune in as I discuss how we can develop and equitably distribute a safe and effective vaccine:  https://t.co/KPxTaqAiVd
1306279178304536576 2020-09-17 01:10:00 +0800 <JoeBiden> We’ve lost nearly 200,000 Americans to COVID-19.   It didn’t have to be this bad — but Donald Trump failed to do his job.
1305884830370988035 2020-09-15 23:03:00 +0800 <JoeBiden> Donald Trump is not responsible for COVID-19, but he is responsible for his failed response and for lying to the American people.  https://t.co/cWuEoHiUxj
1305881558235189249 2020-09-15 22:50:00 +0800 <JoeBiden> This morning, parents all across the West — already worried about their kids being indoors because of COVID-19 — are now also waking up worried about their kids being outside.  We need a president who takes climate change seriously.
1304171037240619008 2020-09-11 05:33:00 +0800 <JoeBiden> Donald Trump is holding a rally in Michigan today—while also refusing to fully fund their National Guard.  These are frontline workers against COVID-19, responsible for testing and distributing food and medical supplies.  Michiganders need a pandemic response—not a pep rally.
1303867788759568384 2020-09-10 09:28:00 +0800 <JoeBiden> Donald Trump knew that COVID-19 was dangerous. He knew it was deadly. And he purposely downplayed it.  Now, nearly 200,000 Americans are dead.  It’s unconscionable.  https://t.co/SLqqhmWy8E
1303495445717512192 2020-09-09 08:48:26 +0800 <JoeBiden> Given his track record, no one can take Trump’s word alone on a COVID-19 vaccine. But with satisfactory answers to these questions, every American can have confidence in a safe and effective COVID-19 vaccine.  https://t.co/074K1HD9wf
1303495442924212224 2020-09-09 08:48:26 +0800 <JoeBiden> 2: Who will validate that the Administration’s decision to greenlight a COVID-19 vaccine is driven by science and not political motivation?   We must hear uncensored statements on efficacy and safety from @FDACBER, the @US_FDA vaccine advisory committee, and Dr. Fauci.
1303495440701313025 2020-09-09 08:48:25 +0800 <JoeBiden> A safe and effective COVID-19 vaccine could save countless lives. We need one as soon as possible.  But while I see a vaccine as a product of science, President Trump sees it as a political tool.  Politics should play no role in this. The Administration must answer the following:
1301926526925983744 2020-09-05 00:54:07 +0800 <JoeBiden> Tune in as I discuss how our economic crisis has been worsened by President Trump's failure to get COVID-19 under control:  https://t.co/YeDBBOntHe
1301208423036407808 2020-09-03 01:20:37 +0800 <JoeBiden> President Trump has failed to address COVID-19 — and now our students and educators are paying the price. Tune in as I discuss my plan to safely and effectively reopen schools:  https://t.co/ntofl4zV7v
1299723485611130887 2020-08-29 23:00:01 +0800 <JoeBiden> We have a president more interested in beating people at golf than beating COVID-19.
1299179647570120704 2020-08-28 10:59:00 +0800 <JoeBiden> From the moment COVID-19 emerged, President Trump downplayed the threat it posed, refused to listen to the experts, and failed to take action to contain its spread.  Now, we’re paying the price.
1299166561299701763 2020-08-28 10:07:00 +0800 <JoeBiden> - 180,000 lives lost - Nearly 6 million confirmed cases of COVID-19 - Over 25 million Americans out of work - Countless small businesses on the brink of closing  That's Donald Trump's America. We're living it every day. We can't take four more years.
1299136865560268800 2020-08-28 08:09:00 +0800 <JoeBiden> Donald Trump and Republicans must have forgotten about the 180,000 American lives lost due to COVID-19.  I promise you that, as president, I never will.
1299059992490721280 2020-08-28 03:03:32 +0800 <JoeBiden> Tune in as @KamalaHarris discusses President Trump’s failure to lead on COVID-19 and what a Biden-Harris administration will do differently:  https://t.co/XzT7AUrG3q
1296482122832777221 2020-08-21 00:20:00 +0800 <JoeBiden> Donald Trump is not responsible for COVID-19 — but he does bear full responsibility for the failed national response.   We've got to hold him accountable this November.
1295547715825344513 2020-08-18 10:27:00 +0800 <JoeBiden> Governor @GretchenWhitmer — thank you for your support and for meeting the COVID-19 crisis with the urgency it demands. The people of Michigan are lucky to have you leading the way. #DemConvention  https://t.co/ef2d4DldRV
1294787205030846465 2020-08-16 08:05:00 +0800 <JoeBiden> We can meet the challenge of COVID-19 and turn the corner on this pandemic. We just need a president and vice president ready and willing to lead.  https://t.co/HqfHD0qB4y
1292264334287044609 2020-08-09 09:00:01 +0800 <JoeBiden> The United States just passed 5 million reported infections of COVID-19. It’s a number that boggles the mind and breaks the heart. Each time the number goes up, it represents a life altered, a family stricken with anxiety, a community on edge. It shouldn’t have gotten this bad.
1292249233316130816 2020-08-09 08:00:00 +0800 <JoeBiden> Donald Trump has refused to take serious action to combat the COVID-19 crisis. And as a result, he got what he’s always wanted — the U.S. isolated from the rest of the world.  https://t.co/owvNL4ul74
1291816882434121728 2020-08-08 03:22:00 +0800 <JoeBiden> Here’s the truth—Donald Trump turned his back on the middle class long before COVID-19. He cut taxes for the super-wealthy, drove U.S. manufacturing into a recession, and stacked the deck against hardworking Americans.  It's time we pick a different path.  https://t.co/rt5RD9WOGA
1291690889874743296 2020-08-07 19:01:21 +0800 <JoeBiden> Here’s how COVID-19 affected Arizonans under the Trump—Ducey model:  - An infection rate—still—of nearly 20% - The fifth-highest number of current hospitalizations in the country - More than 4,000 deaths from COVID-19 - More than 183,000 cases - Lengthy delays in test results
1291369685821186048 2020-08-06 21:45:00 +0800 <JoeBiden> If I'm elected president, our students and educators will have all the tools and resources they need to succeed and get through COVID-19.  https://t.co/ul9vTTcT40
1291172134341840896 2020-08-06 08:40:00 +0800 <JoeBiden> Donald Trump promised to bring back jobs, but his policies crushed the manufacturing sector—and that was true even before COVID-19.  I’ll revitalize American manufacturing and innovation and create millions of good-paying jobs so we can build back better.  https://t.co/HrOOkWWQof
1290812262744305665 2020-08-05 08:50:00 +0800 <JoeBiden> From day one, Donald Trump downplayed the threat COVID-19 posed, ignored scientists, and refused to take action.   Now, nearly 5 million cases and more than 150,000 deaths later, it's crystal clear we're paying the price for his failed leadership.
1289681058871545856 2020-08-02 05:55:00 +0800 <JoeBiden> Rent is due today.  Donald Trump abdicated his responsibility to lead us out of this COVID-19 crisis—and we now face a potential housing crisis because of it.  Mr. President: Act now to make sure Americans don't have to choose between a roof over their heads or food on the table.  https://t.co/b0Uoy5qoFr
1289541388686643202 2020-08-01 20:40:00 +0800 <JoeBiden> Ordinary people doing extraordinary things. That's the story of America — and it's being written every day by folks like Dr. @Craig_A_Spencer, who fought the Ebola outbreak and now COVID-19. @BarackObama and I called to thank him for his service and discuss the moment we're in.  https://t.co/wO14pwaaxa
1289195358518738950 2020-07-31 21:45:00 +0800 <JoeBiden> It’s been over six months since the first confirmed case of COVID-19 in the United States, and President Trump still doesn't have an effective plan to contain its spread. It's an unjustifiable failure of leadership that costs lives every day.
1288546080507002892 2020-07-30 02:45:00 +0800 <JoeBiden> My heart goes out to Jessica and the countless others across the nation who have lost a loved one due to COVID-19. Behind every number we see in the news is a family and community that will never again be whole — and we can't forget that.  https://t.co/S2NrhkXrHI
1286370998216986624 2020-07-24 02:42:00 +0800 <JoeBiden> COVID-19 infections are going up.  The number of deaths is going up.   This morning it was announced that, once again, the number of unemployment claims is going up.   Donald Trump is moving us backwards. The American people are paying the price.
1284243982747414529 2020-07-18 05:50:00 +0800 <JoeBiden> Eleven. That's how many times we've broken the single-day record for new COVID-19 cases in the last month.  This virus isn't going to "just disappear" like President Trump wants. It's surging — and we need real leadership from this White House to slow its spread.
1282683703190188032 2020-07-13 22:30:00 +0800 <JoeBiden> In January, I sounded the alarm regarding COVID-19.   Over five months later, President Trump still hasn't taken the action needed to respond to the virus. It's unacceptable.  This president has failed the American people every step of the way.  https://t.co/PH4vF5KLuI
1281996678980005889 2020-07-12 01:00:01 +0800 <JoeBiden> The United States has over 3 million cases of COVID-19, and over 130,000 people have died — yet Donald Trump continues to say it will just "fade away." It’s unbelievable.  We're paying the price for this president's incompetence every single day.
1280525229106708483 2020-07-07 23:33:00 +0800 <JoeBiden> To beat COVID-19, we need a coordinated national response from the federal government — but Donald Trump refuses to do his job. I've laid out exactly what I would do, and I encourage this president to adopt the plan in its entirety:  https://t.co/SOVOPL7uPy
1280235066975797251 2020-07-07 04:20:00 +0800 <JoeBiden> With COVID-19 surging across the nation, Donald Trump should be doing everything in his power to increase access to testing. Instead, he's doing the opposite. It's despicable.
1279867648218664960 2020-07-06 04:00:00 +0800 <JoeBiden> COVID-19 is surging across the nation, and this president is doubling down on his efforts to rip health insurance and protections away from millions. It's heartless and cruel and must be stopped.
1278415577875394562 2020-07-02 03:50:00 +0800 <JoeBiden> On day one, I’ll get right to work tackling COVID-19. I'll bring together our nation's top experts and leaders from both parties to chart a path forward.  We are all in this together — and we've got to fight this together.  https://t.co/7An2MOGiiF
1276218601528229888 2020-06-26 02:20:00 +0800 <JoeBiden> Health care workers are selflessly risking their lives every day on the front lines of the fight against COVID-19 — and hundreds have paid the ultimate price.  They are American heroes — and we cannot forget the sacrifices they made to care for us all.  https://t.co/JBlSo0mYdb
1275812425120444416 2020-06-24 23:26:00 +0800 <JoeBiden> Workers called back on the job deserve access to regular, reliable COVID-19 testing.
1275430918946263041 2020-06-23 22:10:02 +0800 <JoeBiden> This is yet another attempt to distract from this Administration's failure to lead an effective response to COVID-19. Immigrants help grow our economy and create jobs. The President can't scapegoat his way out of this crisis.
1275151570410393612 2020-06-23 03:40:00 +0800 <JoeBiden> No one should have to choose between their paycheck and their health. That's why my plan for a safe and effective reopening ensures everyone has access to testing and paid leave for all those who get sick from COVID-19.  Read more here:  https://t.co/v6hImc0J3q
1273740271214227456 2020-06-19 06:12:00 +0800 <JoeBiden> Just like Donald Trump couldn’t wish COVID-19 away in March, and just like he couldn’t tweet it away in April — he can’t ignore it away in June.  https://t.co/nOBnrL4rWi
1273416386841214976 2020-06-18 08:45:00 +0800 <JoeBiden> Vice President Pence claimed success because COVID-19 deaths are “down to” fewer than 750 a day.  That's more than 20,000 a month — and they're self-congratulating? Unbelievable.  It may be good enough for President Trump, but it will never be acceptable if I am President.  https://t.co/9h08nxjC6k
1273361303973900289 2020-06-18 05:06:07 +0800 <JoeBiden> Donald Trump ignored the experts, downplayed the threat COVID-19 posed, and failed to take the action necessary to contain it — and now in many states, COVID cases are on the rise again.  This president has failed to lead our nation.
1272619889501454337 2020-06-16 04:00:00 +0800 <JoeBiden> Donald Trump is not responsible for COVID-19, but he does bear full responsibility for his slow, uncoordinated, bungled response.  https://t.co/IUdWpqZncn
1272182010816143360 2020-06-14 23:00:02 +0800 <JoeBiden> We have to ensure every worker called back on the job has access to regular, reliable COVID-19 testing and effective personal protective equipment.  https://t.co/lDPQP3jZkw
1271464778238537729 2020-06-12 23:30:00 +0800 <JoeBiden> Donald Trump forgot about COVID-19, but COVID-19 didn’t forget about us.   The President couldn’t wish away the virus in April, he couldn’t tweet it away in May, and he can’t ignore it away in June.
1271216894025052160 2020-06-12 07:05:00 +0800 <JoeBiden> COVID-19 can affect anyone, anywhere — but it doesn't impact every community equally. Watch as Dr. Ebony Jade Hilton explains how it’s impacting communities of color:  https://t.co/3uuXEsfyv4
1270509734206947328 2020-06-10 08:15:00 +0800 <JoeBiden> Because of Donald Trump's negligence and incompetence:   - More than 110,000 people have died - We have nearly 2 million cases of COVID-19 - Over 20 million Americans are out of work   And yet he’s patting himself on the back. Unbelievable.
1270131491935223809 2020-06-09 07:12:00 +0800 <JoeBiden> At every turn, President Trump ignored the experts, downplayed the threat COVID-19 posed, and misled the American people — and we’re all paying the price every single day.  https://t.co/klaYVm3gpY
1266874530779275264 2020-05-31 07:30:00 +0800 <JoeBiden> Trump’s Tantrum Diplomacy is eroding U.S. credibility on the international stage. Withdrawing from @WHO during a global pandemic is a recipe for disaster and increases the cost of the American response. We must instead rally the world to confront COVID-19.
1265726466051977218 2020-05-28 03:28:00 +0800 <JoeBiden> Over the last few months, countless Asian Americans have been threatened, attacked, and blamed for COVID-19. They've cruelly been made the scapegoat by the most powerful man on the planet, President Trump. It has to end.  Read more from @TammyforIL and me:  https://t.co/W7h54A91U9
1265652855651762177 2020-05-27 22:35:30 +0800 <JoeBiden> Tune in now as @TomWolfPA joins me for a conversation on how COVID-19 is impacting states:  https://t.co/3gMLagg78X
1265624830096936960 2020-05-27 20:44:08 +0800 <JoeBiden> This morning, I’ll be joined by @TomWolfPA for a conversation on how COVID-19 is making an impact on states.   Tune in live at 10:30AM EDT:  https://t.co/xk0GcSpr50  https://t.co/D6Ewy1xm78
1265289085150736384 2020-05-26 22:30:00 +0800 <JoeBiden> We are months into this crisis, and Donald Trump still doesn't have a comprehensive plan when it comes to COVID-19 or the economy. It's unacceptable. I released a detailed plan laying out what I would do months ago, and have built on it since. Take a look:  https://t.co/xjxsDn2qCD
1264654905714728960 2020-05-25 04:30:00 +0800 <JoeBiden> Hunger today isn’t about scarcity — it’s about a massive failure in leadership.   If I were President, I’d immediately work with @chefjoseandres to empower our restaurants to be part of the solution as families go hungry during the COVID-19 crisis.  https://t.co/dGqSDgqXpM
1264264835036000257 2020-05-24 02:40:00 +0800 <JoeBiden> The hard truth is Donald Trump ignored the warnings of health experts and intelligence agencies, downplayed the threat COVID-19 posed, and failed to take the action needed to combat the outbreak.  It’s one of the greatest failures of presidential leadership in our history.
1263867235224834048 2020-05-23 00:20:05 +0800 <JoeBiden> Join Andrew Yang to discuss the economic impact of COVID-19. Tune in now:  https://t.co/bKZ6bvcfXv
1262932298082799624 2020-05-20 10:24:58 +0800 <JoeBiden> Congratulations to Dr. @iingwen on the start of her second term. Taiwan’s thriving democracy and response to COVID-19 are an example to the world. America’s support for Taiwan must remain strong, principled, and bipartisan.
1262863098702004224 2020-05-20 05:50:00 +0800 <JoeBiden> Tonight, I'll be joining @chefjoseandres for a virtual town hall to discuss the impact of COVID-19 on food security and the restaurant industry — and what our government should be doing to ensure no one in America goes hungry.  Watch live at 7 PM ET:  https://t.co/KG9y39EA8s
1262042693489905664 2020-05-17 23:30:00 +0800 <JoeBiden> Behind every COVID-19 death is a family and a community that will never be the same.  Behind every unemployment claim is a life thrown into uncertainty — a person wondering how they’ll make ends meet.  There is a real human toll to this crisis. We cannot forget that.
1261384606433058816 2020-05-16 03:55:00 +0800 <JoeBiden> To everyone who has lost a loved one due to COVID-19: I know it's incredibly difficult right now, but there will come a time when their memory brings a smile to your lips before it brings a tear to your eye. It will take time, but that’s when you know you’re going to make it.  https://t.co/bGyr3AIbWH
1261090619285540864 2020-05-15 08:26:48 +0800 <JoeBiden> Tonight, @StaceyAbrams and I will be joining @Lawrence for a discussion on combating COVID-19 and how we can ensure everyone can make their voice heard this November.  Tune in to @MSNBC at 10 PM ET to watch live.
1261018512920731648 2020-05-15 03:40:16 +0800 <JoeBiden> Join me for a virtual roundtable on COVID-19 with Governors Gretchen Whitmer, Phil Murphy and Ned Lamont who are at the forefront of this crisis:  https://t.co/qMB1AT6ST1
1260986986820599812 2020-05-15 01:35:00 +0800 <JoeBiden> With the void of leadership in the White House, governors across the country have stepped up to meet this moment. This afternoon, I’ll be joined by a few of them for a roundtable discussion on COVID-19.   Tune in at 3:30 PM ET to watch:  https://t.co/xk0GcS7PGq  https://t.co/1EONVfE0pk
1260570499320446976 2020-05-13 22:00:01 +0800 <JoeBiden> Donald Trump can put up all of the banners he wants in the Rose Garden, but it doesn’t change the fact that he failed our nation when it comes to COVID-19 testing.  https://t.co/GDPuOAxndd
1258908289334640644 2020-05-09 07:55:00 +0800 <JoeBiden> Make no mistake: COVID-19 has caused a massive economic challenge. But this crisis hit us harder, and will last longer, because Donald Trump spent the last three years undermining the core pillars of our economic strength.  https://t.co/4nkrpNDXgs
1258583650150477830 2020-05-08 10:25:00 +0800 <JoeBiden> I can't hit the campaign trail in-person due to COVID-19 — so instead, I’m traveling across the country from my home in Delaware. Head over to my Instagram to catch up on today’s trip to Florida 📲.
1258527300540182531 2020-05-08 06:41:05 +0800 <JoeBiden> Every step of the way, President Trump has ignored the experts, downplayed the threat COVID-19 posed, and misled the American people — and we’re all paying the price every single day.  I promise you, I will do the opposite.
1258199619722502147 2020-05-07 08:59:00 +0800 <JoeBiden> We can't host any in-person events due to COVID-19, but that won't stop me from hitting the campaign trail—virtually, of course. Tomorrow, I'll be making stops around Florida and wrapping up the day with a virtual rally in Tampa.  Tune in at 5:15 PM ET:  https://t.co/xk0GcSpr50  https://t.co/H3ZAyxhxxj
1258095433886375940 2020-05-07 02:05:00 +0800 <JoeBiden> We can’t sit by as Donald Trump and Republicans use COVID-19 as an excuse to disenfranchise voters. We need to ensure people have the opportunity to vote by mail, early vote, vote absentee and, in every way possible, safely vote in person this November.  https://t.co/uKRyR3LVTA
1258063979412250628 2020-05-07 00:00:01 +0800 <JoeBiden> Today, amid the COVID-19 pandemic, the Trump-backed lawsuit to dismantle the ACA enters a new phase. If Trump and Republican AGs succeed, it’ll mean devastation for our health care system that will cause untold pain and suffering. We can't let that happen.  https://t.co/TVb3TIKsny
1257403121363415040 2020-05-05 04:14:00 +0800 <JoeBiden> Over 1 million cases of COVID-19. Almost 70,000 dead. What is upsetting President Trump? Tough questions from the press.  Cry me a river, Mr. President.  https://t.co/MbSZJ0UMel
1256653934837538816 2020-05-03 02:37:00 +0800 <JoeBiden> Mi corazón y el de Jill están con Puerto Rico a raíz de los terremotos de hoy. Mientras la isla enfrenta el impacto de este suceso y la pandemia del COVID-19 tenemos que asegurarnos que reciban los recursos y la asistencia que necesitan para recuperarse lo más pronto posible.
1255988550522351620 2020-05-01 06:33:00 +0800 <JoeBiden> Instead of preparing our country to fight COVID-19, Donald Trump wasted months and promised it would miraculously go away by April.  He was wrong. And we're all paying the price.  https://t.co/R0tDbI1WZr
1255884615744516097 2020-04-30 23:40:00 +0800 <JoeBiden> As president, I promise you I'll honor all those we've lost from COVID-19.  https://t.co/9N00PTSNHw
1255647805118377985 2020-04-30 07:59:00 +0800 <JoeBiden> The words of a president matter — and Donald Trump has used his to downplay COVID-19, pass blame onto others, and mislead the American people. I will do the opposite.  https://t.co/6ZViv3tdW7
1255297119457607681 2020-04-29 08:45:30 +0800 <JoeBiden> There are nearly 330 million people in the United States — and according to the Trump White House, we've only conducted 5.4 million COVID-19 tests. It's abysmal.  Donald Trump needs to scale up testing, and he needs to do it immediately.
1255211518167142400 2020-04-29 03:05:21 +0800 <JoeBiden> COVID-19 is affecting the entire nation, but the impact doesn’t look the same for everyone. I'm hosting a town hall on how COVID-19 is impacting women — and I'll be joined by special guest Hillary Clinton. Tune in now to watch:  https://t.co/sQBaHGHgRQ
1254940897130811393 2020-04-28 09:10:00 +0800 <JoeBiden> Tomorrow afternoon, I'll be hosting a town hall on how COVID-19 is impacting women — and I'll be joined by a special guest. Tune in at 3 PM ET to watch:  https://t.co/xk0GcSpr50  https://t.co/nw44aea7UP
1254875960744255488 2020-04-28 04:51:58 +0800 <JoeBiden> COVID-19 is a danger to everyone. We will stop it by coming together as one America — not by targeting others.  Thank you for helping lead this fight, @AndrewYang.
1254857452656267264 2020-04-28 03:38:25 +0800 <JoeBiden> Join Senator Kamala Harris and Symone Sanders for a town hall addressing the impact and disparities of COVID-19 in the Black community. Tune in now:  https://t.co/coThZJGoej
1254806260324749315 2020-04-28 00:15:00 +0800 <JoeBiden> COVID-19 can hit anyone, anywhere — but it doesn’t affect every community equally. This afternoon, join Senator @KamalaHarris and @SymoneDSanders for a discussion on its disproportionate impact on communities of color.  Tune in at 3:30 PM ET:  https://t.co/xk0GcSpr50  https://t.co/lzco7XHP53
1254782856074637319 2020-04-27 22:42:00 +0800 <JoeBiden> We want our country to get moving and healthy again. But we must take the necessary, rational steps, grounded in science, to do so safely, so COVID-19 doesn’t come roaring back.  https://t.co/ivYeRgrf4q
1254429527700275200 2020-04-26 23:18:00 +0800 <JoeBiden> The workers on the front lines of this crisis are risking their lives every day to combat COVID-19 and keep this country running. The least we can do is provide them the pay and protection they need and deserve.  https://t.co/cL67OThz8m
1254172769882865670 2020-04-26 06:17:44 +0800 <JoeBiden> Older adults are especially vulnerable to COVID-19. Recognizing that, Erica decided to organize youth in her community to buy groceries for seniors — ensuring they receive the food they need while staying safe at home. She's a true hero.
1253383636264595456 2020-04-24 02:02:00 +0800 <JoeBiden> Times of crisis often bring out our best. There are so many stories of good happening around the world amid the COVID-19 pandemic. Take a minute to read a few:  https://t.co/sbiSVrBXhW
1253122666422169600 2020-04-23 08:45:00 +0800 <JoeBiden> Workers, like grocery store cashiers, are on the front lines of this crisis risking their lives every day to combat COVID-19 and keep this country running. President Trump is refusing to do his job, but we've got to do ours. Learn more:  https://t.co/Cio6Bp8GYq #ShopSmart
1252950280708055040 2020-04-22 21:20:00 +0800 <JoeBiden> Folks, we just launched a special #EarthDay episode of Here's the Deal! Governor @JayInslee joins me for a discussion on COVID-19, climate change, and why he's supporting our campaign.  Listen to the full episode now:  https://t.co/gfVHzRcDXo  https://t.co/DRJyrZ5njV
1252692330865405953 2020-04-22 04:15:00 +0800 <JoeBiden> I know COVID-19 is causing many people to feel anxious about what the future holds or lonely during this time of social distancing — and that's okay, just know that you're not alone. I've asked my friend, Dr. Vivek Murthy, to share a few tips on how to get through this:  https://t.co/Hx9TMlF2zP
1252235319526608905 2020-04-20 21:59:00 +0800 <JoeBiden> On this week’s episode of Here’s the Deal, Senator @AmyKlobuchar joins me for a discussion on how COVID-19 has impacted her family and what drove her to get involved in politics.  Listen to the full episode at:  https://t.co/t11Fa0TZjc  https://t.co/YaLgMAQNff
1252009937896640513 2020-04-20 07:03:25 +0800 <JoeBiden> Tune in to watch @SymoneDSanders and actor @TonyGoldwyn host a town hall on how COVID-19 has impacted workers in the entertainment industry:  https://t.co/xk0GcSpr50
1251977258601975810 2020-04-20 04:53:33 +0800 <JoeBiden> .@DrBiden and I are keeping the loved ones of the more than 40,000 people in the U.S. we've lost due to COVID-19 in our prayers. This is a solemn day for our nation, and there will be more hard days ahead. But if we pull together, we will get through this. I promise.
1251968310087782400 2020-04-20 04:18:00 +0800 <JoeBiden> Tonight, @SymoneDSanders and actor @TonyGoldwyn will be hosting a town hall focused on how COVID-19 is impacting workers in the entertainment industry.  Tune in at 7 PM ET to watch:  https://t.co/xk0GcS7PGq  https://t.co/VmSvAbIaon
1251888534627082243 2020-04-19 23:01:00 +0800 <JoeBiden> At a time when studies are linking air pollution with COVID-19 mortality rates for the most vulnerable in our society, the Trump Administration is rolling back environmental protections — allowing more poison into our air.  https://t.co/047lsdtrQN
1251653085925179392 2020-04-19 07:25:24 +0800 <JoeBiden> I couldn't be prouder of my friends @LadyGaga and Chris Martin of @Coldplay for organizing the @GlblCtzn One World: #TogetherAtHome broadcast. We are all in this fight together — and if we stand as one, we will defeat COVID-19.
1251621524928253952 2020-04-19 05:20:00 +0800 <JoeBiden> On Sunday night, @SymoneDSanders and actor @TonyGoldwyn will be hosting an unemployment town hall on how COVID-19 is impacting entertainment workers.   Tune in tomorrow at 7 PM ET to watch live:  https://t.co/xk0GcS7PGq  https://t.co/NEMjeyisJx
1251274236808790017 2020-04-18 06:20:00 +0800 <JoeBiden> Donald Trump is not responsible for COVID-19, but he is responsible for our slow, uncoordinated response.  Experts say that if we had acted two weeks earlier, more lives could have been saved.  Trump failed to take swift action—and we're paying the price.  https://t.co/nyq6DpLOid
1251224408959651840 2020-04-18 03:02:00 +0800 <JoeBiden> President Trump is trying to rewrite history when it comes to China and COVID-19 — but the facts don't back him up. Tony Blinken was the Deputy Secretary of State and is one of my top foreign policy advisors. He'll explain.  https://t.co/si3vDHnF2r
1250889199621832704 2020-04-17 04:50:00 +0800 <JoeBiden> These racist acts have got to stop. No one should be targeted for what they look like, where they or their ancestors come from, or who they are.  COVID-19 is a danger to everyone. We will stop it by coming together—not by targeting people of AAPI heritage.  https://t.co/y8vYAQzvsW
1250789795246166017 2020-04-16 22:15:00 +0800 <JoeBiden> To combat COVID-19, we need a decisive public health response to curb its spread and a comprehensive economic response that delivers real relief to Americans.  I've released several plans outlining exactly what I would do if I were president. Take a look:  https://t.co/YLHCGF1YM9
1250473963542593536 2020-04-16 01:20:00 +0800 <JoeBiden> COVID-19 is amplifying so many inequities in our society. We have to ensure support gets to those who need it immediately, and then do the necessary work to rip out the structural racism that creates these inequalities.  https://t.co/fDUcAdfOHz
1250227340145197056 2020-04-15 09:00:00 +0800 <JoeBiden> I want Donald Trump to look these folks in the eye and explain to them why they or their loved ones haven’t been able to get tested for COVID-19. We’ve got to do better.  https://t.co/CUY6nmCPjl
1249820910434967553 2020-04-14 06:05:00 +0800 <JoeBiden> For months, the Trump Administration was repeatedly warned about the threat COVID-19 posed to our nation. They ignored the experts, failed to take action, and now Americans are paying the price.  https://t.co/YiSTQPnLNy
1249753465879801856 2020-04-14 01:37:00 +0800 <JoeBiden> Folks, I hope you'll join my 2:00 PM Economic Response to COVID-19 remarks — I'll be joined by a special guest. Tune in at 2:00 PM to watch live!   https://t.co/xk0GcS7PGq  https://t.co/KmSe2QvcQD
1249724022281117696 2020-04-13 23:40:00 +0800 <JoeBiden> Tune in at 2:00 PM today for remarks on the urgent and dire need for a full economic response to COVID-19 at  https://t.co/xk0GcSpr50.  https://t.co/fOhLzMVifQ
1249434614768132097 2020-04-13 04:30:00 +0800 <JoeBiden> To everyone on the front lines of the fight against COVID-19, thank you. We truly couldn't get through this without you.
1248657242792046593 2020-04-11 01:01:00 +0800 <JoeBiden> The health inequities being exposed by COVID-19 are unconscionable.  We can do better. We have to.  https://t.co/2T1hcOas9z
1247951089581817862 2020-04-09 02:15:00 +0800 <JoeBiden> In the wake of COVID-19, working families across the country are facing a whole new set of challenges. This afternoon, I'll be hosting a town hall to listen to folks' concerns and discuss what we should be doing to deliver relief.  Tune in at 5:30 PM ET:  https://t.co/xk0GcSpr50  https://t.co/Xzgoj0E4vB
1247699431442370561 2020-04-08 09:35:00 +0800 <JoeBiden> We’re starting to see evidence that long-term exposure to air pollution—which disproportionately affects communities of color &amp; low-income communities—is linked to COVID-19 death rates. It's past time we treat pollution like the threat to our health it is.  https://t.co/3GD15s3xSy
1247654894187790337 2020-04-08 06:38:01 +0800 <JoeBiden> On #WorldHealthDay, we thank the tireless health care workers fighting COVID-19, and we see clearly why protecting the health of Americans requires U.S. global leadership—to coordinate an international response, strengthen health systems everywhere, and prevent the next pandemic.
1247296778095005696 2020-04-07 06:55:00 +0800 <JoeBiden> For months, I called on President Trump to step up and take the action necessary to combat COVID-19.  But week after week, he downplayed the threat it posed, misled the American people, and failed to act.  Take a look:  https://t.co/IkkkdeRS8V
1247283692231245824 2020-04-07 06:03:00 +0800 <JoeBiden> Judy, from itsJudysLife, asked an important question during our Family Town Hall on COVID-19: What extra precautions should expectant mothers be taking at this time?  Listen to what former U.S. Surgeon General Dr. Vivek Murthy had to say:  https://t.co/Z1el7lgoyJ
1247192340311220224 2020-04-07 00:00:00 +0800 <JoeBiden> Folks, our second episode of Here’s the Deal is live! This week, @GovWhitmer joins me for a discussion on COVID-19, President Trump’s personal attacks, and the importance of bipartisanship to deliver results.  Listen at  https://t.co/t11Fa0CorE or wherever you get your podcasts.
1246942946684891136 2020-04-06 07:29:00 +0800 <JoeBiden> During our Family Town Hall on COVID-19, I was asked what we can do to prevent this from happening again. Here’s where I'd start:  https://t.co/A4M8u9W2SR
1246935396849598467 2020-04-06 06:59:00 +0800 <JoeBiden> During these uncertain times, getting the right information out there is so important.  Myself and @DrBiden had the opportunity to host a conversation about COVID-19 with 3 family vloggers: ItsJudysLife, J House Vlogs and The Curly Coopers. Tune in now:  https://t.co/xk0GcS7PGq
1246867701869490182 2020-04-06 02:30:00 +0800 <JoeBiden> We all want to protect our families — the first step is arming ourselves with the facts.   @DrBiden and I hosted a town hall on COVID-19 with three family YouTubers: ItsJudysLife, J House Vlogs and The Curly Coopers. Tune in tonight at 7PM EDT:  https://t.co/xk0GcSpr50  https://t.co/gIEPo2PjuO
1246550611606138880 2020-04-05 05:30:00 +0800 <JoeBiden> Jill and I had the pleasure of hosting a town hall with family vloggers ItsJudysLife, The Curly Coopers, and JHouse Vlogs where we answered their questions about the COVID-19 outbreak.  Tune in to the premiere on Sunday at 7PM ET:  https://t.co/xk0GcS7PGq  https://t.co/9fqyYsGwMJ
1246470080826871808 2020-04-05 00:10:00 +0800 <JoeBiden> In January, while Donald Trump was downplaying COVID-19, I wrote an op-ed calling for immediate action to combat the growing threat.  In it, I also said Trump was the worst possible leader to deal with a public health crisis.  I stand by that statement.  https://t.co/PH4vF5taDa
1246153998161215493 2020-04-04 03:14:00 +0800 <JoeBiden> Families across the country are impacted by COVID-19—and it can be especially difficult to explain to children.   Jill and I spoke with ItsJudysLife, JHouseVlogs and The Curly Coopers to answer their questions about the crisis. Tune in on Sunday at 7PM ET:  https://t.co/xk0GcS7PGq  https://t.co/TUQnhOroTU
1246106938104074242 2020-04-04 00:07:00 +0800 <JoeBiden> Now more than ever, we need to choose hope over fear. We will beat COVID-19. We will overcome this. Together.
1244980264100605953 2020-03-31 21:30:00 +0800 <JoeBiden> In order to combat COVID-19, we need both a decisive public health response and a decisive economic response. I’ve laid out exactly what I would do if I were president during this crisis, take a look:  https://t.co/Q58OQW6tQO
1244765096284479496 2020-03-31 07:15:00 +0800 <JoeBiden> This is unconscionable. Americans are already afraid of the impact the deadly COVID-19 pandemic is having on their lives — they don't need the added stress of losing their health insurance. Drop the lawsuit.  https://t.co/VyN90rluy9
1244742447126593536 2020-03-31 05:45:00 +0800 <JoeBiden> I know these are confusing and scary times, so for the first episode of our new podcast I sat down with Ron Klain, former White House Ebola Response Coordinator, to help provide some clarity around COVID-19.  Listen at  https://t.co/gfVHzRcDXo or wherever you get your podcasts.  https://t.co/bCd1houIqo
1244607055215726593 2020-03-30 20:47:00 +0800 <JoeBiden> Not a joke, folks, we just launched our new podcast. It’s called "Here's the Deal." For our first episode, I sat down with Ron Klain, former White House Ebola Response Coordinator, for a discussion on COVID-19.  Listen at  https://t.co/t11Fa0TZjc or wherever you get your podcasts.
1243717694572179457 2020-03-28 09:53:00 +0800 <JoeBiden> I just wrapped up tonight’s CNN town hall, where we discussed COVID-19 and how we move forward. I know times are tough, but the stakes in this election have never been higher. If you could chip in a few dollars I would really appreciate it.  https://t.co/1PoT5yD9CO
1243670382902759424 2020-03-28 06:45:00 +0800 <JoeBiden> In response to the economic impact of COVID-19, we need to provide immediate relief to those who are drowning in student debt.  https://t.co/kyZstGHHCG
1243632793927577600 2020-03-28 04:15:38 +0800 <JoeBiden> Join me and the hardworking folks on the frontlines of the COVID-19 outbreak for a virtual round table. Tune in now:  https://t.co/SKRTT621IO
1243621727642542081 2020-03-28 03:31:39 +0800 <JoeBiden> This afternoon, I’ll be sitting down for a conversation with nurses, firefighters, and emergency medical technicians on the front lines of the fight against COVID-19. Tune in at 4:15 ET to join us:  https://t.co/xk0GcSpr50
1243349519179317249 2020-03-27 09:30:00 +0800 <JoeBiden> The relief bill passed by Congress was a good start, but now we need to:  - Forgive at least $10,000 of student loan debt per person - Provide emergency paid sick leave to everyone who needs it - Ensure no one has to pay for COVID-19 treatment or an eventual vaccine
1240798575468175364 2020-03-20 08:33:27 +0800 <JoeBiden> The words of a president matter, and Donald Trump has used his to downplay COVID-19 and mislead the American people. He is unfit to lead us through this crisis.
1240761659888672769 2020-03-20 06:06:46 +0800 <JoeBiden> Every worker on the front lines of the fight against COVID-19 deserves protections and accommodations that keep them and their families safe. I'm glad to see states stepping up to support folks — employers must do the same.
1240646710021537792 2020-03-19 22:30:00 +0800 <JoeBiden> The Obama-Biden Administration set up the White House National Security Council Directorate for Global Health Security and Biodefense to prepare for future pandemics like COVID-19.  Donald Trump eliminated it — and now we're paying the price.
1239201266410164224 2020-03-15 22:46:19 +0800 <JoeBiden> If you're exhibiting symptoms of COVID-19 — or might be at risk — absentee or vote by mail options are the best way to make your voice heard, while protecting your neighbors.
1239200647616004096 2020-03-15 22:43:52 +0800 <JoeBiden> The right to vote is the most sacred American right there is. State election officials are working closely with public health officials to hold safe elections. If you are feeling healthy, not showing symptoms, and not at risk of being exposed to COVID-19: please vote on Tuesday.
